
#+title: 01 Strings, Lists and Dictionaries
#+author: Sajid Mahmood
#+source: Google IT Automation with Python Professional Certificate
#+include: Crash Course on Python
#+week: Week 4
#+date:  <2022-04-18 Mon>
#+options: toc:2

*** Negative Indexing

It indexes from the last member of the string.
+ Negative indexing starts with -1, -2, .......

  #+begin_src python :results output
def first_and_last(message):
    if len(message) == 0:
        return False
    elif message[0] == message [-1]:
        return True
    elif message[0] != message[-1]:
        return False
print(first_and_last('esle'))
print(first_and_last('tree'))
print(first_and_last(''))
  #+end_src

  #+RESULTS:
  : True
  : False
  : False

*** String Class Method

A function associated with a specific class.

#+begin_src python :results output
pets = 'Cats & Dogs'
print(pets.index('&'))
#+end_src

#+RESULTS:
: 5

